///Дан массив с числами. Сделайте из него массив, состоящий из квадратов этих чисел.[1, 2, 3, 0, 4, 5, 6]///
//
// function handleNumber(array){
//     return array.map(el => el*el)
// }
// console.log(handleNumber([1, 2, 3, 0, 4, 5, 6]))
//////////////////////////////////////////////////////////////////////

//Дан массив с числами. Проверьте то, что все элементы в массиве больше нуля.
//
// [1, 2, 3, 0, 4, 5, 6]
//  function checkNumber(array){
//     return array.map(el => el > 0)
//  }
// console.log(checkNumber([1, 2, 3, 0, 4, 5, 6]))
///////////////////////////////////////////////////////////////////////

// Дан массив с числами. Проверьте то, что в нем есть отрицательные элементы.
//
// [1, 2, -3, 0, 4, -5, 6]
//
// let array = [1, 2, -3, 0, 4, -5, 6]
//
// console.log(array.map(el => el < 0))

//////////////////////////////////////////////////////////////////////

//Дан массив с числами. Оставьте в нем только отрицательные числа.
//
// [1, 2, -3, 0, 4, 5, -6]

// let array = [1, 2, -3, 0, 4, 5, -6]
//
// console.log(array.filter(el => el<0))

///////////////////////////////////////////////////////////////////////

//Дан массив с числами. Оставьте в нем только четные числа.
//
// [1, -2, 3, 0, 4, -5, 6]
//
// let array = [1, -2, 3, 0, 4, -5, 6]
//
// console.log(array.filter(el => el % 2 ===0))

////////////////////////////////////////////////////////////////////////

//Дан массив со строками. Оставьте в нем только те строки, длина которых больше 5-ти символов.
//
// ['hello', 'sit', 'ipsum', 'javascript', 'python', 'sun, 'even]
// function checkLength(array){
//     return array.filter(el => el.length > 5)
// }
// console.log(checkLength(['hello', 'sit', 'ipsum', 'javascript', 'python', 'sun', 'even']))

///////////////////////////////////////////////////////////////////////

//Дан массив с числами. Посчитайте количество отрицательных чисел в этом массиве.
//
// [1, 2, -3, 0, -4, 5, -6]
//
// const array = [1, 2, -3, 0, -4, 5, -6]
// console.log(array.filter(el=> el < 0).length)

//////////////////////////////////////////////////////////////////////////

// [1,2,3,4], ['a','b','c','d'] => [1, 2, 3, 4, 'a', 'b', 'c', 'd']

// const array =[1,2,3,4]
// const array2 =['a','b','c','d']
//
// console.log([...array,...array2])

/////////////////////////////////////////////////////////////////////////

//[2, 3, 4, 5], 'hello world' => [2, 3, 4, 5, 'hello world']
//
// const array = [2, 3, 4, 5]
// const str = 'hello world'
//
// console.log([...array,...str.split('.')])

////////////////////////////////////////////////////////////////////////////

// [2, 3, 4, 5], 'hello world' => [2, 3, 4, 5, 'h', 'e', 'l', 'l', 'o', 'w', 'o', 'r', 'l', 'd']

// const array = [2, 3, 4, 5]
// const str = 'hello world'
//
// console.log([...array,...str])

////////////////////////////////////////////////////////////////////////////

// [2, 3, 4, 5], 'hello world'
// => [2, 3, 4, 5, 'h', 'e', 'l', 'l', 'o', 'w', 'o', 'r', 'l', 'd', 2, 3, 4, 5]

// const array = [2, 3, 4, 5]
// const str = 'hello world'
//
// console.log([...array, ...str, ...array])








